terjeio/grblHAL/drivers/MSP430F5529/driver.c
/*
  driver.c - An embedded CNC Controller with rs274/ngc (g-code) support

  Driver code for Texas Instruments MSP430F5529 16-bit processor

  Part of GrblHAL

  Copyright (c) 2016-2020 Terje Io
  Copyright (c) 2011-2015 Sungeun K. Jeon
  Copyright (c) 2009-2011 Simen Svale Skogsrud

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <msp430.h>

#include "driver.h"
#include "serial.h"
#include "grbl/hal.h"
#include "grbl/grbl.h"
#include "grbl/nuts_bolts.h"
#include "eeprom/eeprom.h"

#ifdef EEPROM_ENABLE
#include "eeprom/eeprom.h"
#endif

static volatile uint16_t debounce_count = 0;
static bool pwmEnabled = false, IOInitDone = false;
static uint16_t pulse_length;
static axes_signals_t next_step_outbits;
static spindle_pwm_t spindle_pwm;
static delay_t delay = { .ms = 0, .callback = NULL };
static probe_state_t probe = {
    .connected = On
};

static void spindle_set_speed (uint_fast16_t pwm_value);

static void driver_delay_ms (uint32_t ms, void (*callback)(void))
{
    if((delay.ms = ms > 0)) {
        SYSTICK_TIMER_CCR0 = ms;
        SYSTICK_TIMER_CTL |= TACLR|MC0;
        if(!(delay.callback = callback))
            while(delay.ms);
    } else if(callback)
        callback();
}

// Set stepper pulse output pins
// NOTE: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z, needs to be mapped to physical pins by bit shifting or other means
inline static __attribute__ ((always_inline)) void set_step_outputs (axes_signals_t step_outbits)
{
    STEP_PORT_OUT = (STEP_PORT_OUT & ~HWSTEP_MASK) | (step_outbits.mask ^ settings.steppers.step_invert.mask) << 1;
}

// Set stepper direction output pins
// NOTE1: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z, needs to be mapped to physical pins by bit shifting or other means
inline static __attribute__ ((always_inline)) void set_dir_outputs (axes_signals_t dir_outbits)
{
    DIRECTION_PORT_OUT = (DIRECTION_PORT_OUT & ~HWDIRECTION_MASK) | (dir_outbits.mask ^ settings.steppers.dir_invert.mask);
}

// Enable/disable stepper motors
static void stepperEnable (axes_signals_t enable)
{
    enable.mask ^= settings.steppers.enable_invert.mask;

    if(enable.x)
        STEPPERS_DISABLE_OUT_XY &= ~STEPPERS_DISABLE_PIN_XY;
    else
        STEPPERS_DISABLE_OUT_XY |= STEPPERS_DISABLE_PIN_XY;

    if(enable.z)
        STEPPERS_DISABLE_OUT_Z &= ~STEPPERS_DISABLE_PIN_Z;
    else
        STEPPERS_DISABLE_OUT_Z |= STEPPERS_DISABLE_PIN_Z;
}

// Starts stepper driver ISR timer and forces a stepper driver interrupt callback
static void stepperWakeUp ()
{
    stepperEnable((axes_signals_t){AXES_BITMASK});

    STEPPER_TIMER_CCR0 = 0xFFFF;        // Set a long initial delay,
    STEPPER_TIMER_CTL |= TACLR|MC0;     // start stepper ISR timer in up mode
    hal.stepper.interrupt_callback();   // and start the show
}

// Disables stepper driver interrupts
static void stepperGoIdle (bool clear_signals)
{
    STEPPER_TIMER_CTL &= ~(MC0|MC1);
    if(clear_signals) {
        set_step_outputs((axes_signals_t){0});
        set_dir_outputs((axes_signals_t){0});
    }
}

// Sets up stepper driver interrupt timeout, AMASS version
static void stepperCyclesPerTick (uint32_t cycles_per_tick)
{
    STEPPER_TIMER_CTL |= TACLR; // start in up mode
    STEPPER_TIMER_CCR0 = cycles_per_tick < (1UL << 16) ? (uint16_t)cycles_per_tick : 0xFFFF;
}

// Sets up stepper driver interrupt timeout, "Normal" version
static void stepperCyclesPerTickPrescaled (uint32_t cycles_per_tick)
{
    // Set timer prescaling for normal step generation
    if (cycles_per_tick < (1UL << 16)) { // < 65536  (2.6ms @ 25MHz)
        STEPPER_TIMER_EX0 = TAIDEX_0;  // DIV 1
        STEPPER_TIMER_CTL &= ~(ID0|ID1); // DIV 1
    } else if (cycles_per_tick < (1UL << 19)) { // < 524288 (32.8ms@16MHz)
        STEPPER_TIMER_EX0 = TAIDEX_0; // DIV 1
        STEPPER_TIMER_CTL |= ID0|ID1; // DIV 8
        cycles_per_tick = cycles_per_tick >> 3;
    } else {
        STEPPER_TIMER_EX0 = TAIDEX_7; // DIV 8
        STEPPER_TIMER_CTL |= ID0|ID1; // DIV 8
        cycles_per_tick = cycles_per_tick >> 6;
    }
    STEPPER_TIMER_CCR0 = cycles_per_tick < (1UL << 16) ? (uint16_t)cycles_per_tick : 0xFFFF;
    STEPPER_TIMER_CTL |= TACLR|MC0;
}

// Sets stepper direction and pulse pins and starts a step pulse
// When delayed pulse the step register is written in the step delay interrupt handler
static void stepperPulseStart (stepper_t *stepper)
{
    if(stepper->dir_change)
        set_dir_outputs(stepper->dir_outbits);

    if(stepper->step_outbits.value) {
        set_step_outputs(stepper->step_outbits);
        PULSE_TIMER_CTL |= TACLR|MC0;
    }
}

// Start a stepper pulse, delay version.
// Note: delay is only added when there is a direction change and a pulse to be output.
static void stepperPulseStartDelayed (stepper_t *stepper)
{
    if(stepper->dir_change) {

        set_dir_outputs(stepper->dir_outbits);

        if(stepper->step_outbits.value) {
            next_step_outbits = stepper->step_outbits; // Store out_bits
            PULSE_TIMER_CCR0 = 50000;
            PULSE_TIMER_CCTL1 &= ~CCIFG;               // Clear and
            PULSE_TIMER_CCTL1 |= CCIE;                 // enable CCR1 interrupt.
            PULSE_TIMER_CTL |= TACLR|MC0;
        }

        return;
    }

    if(stepper->step_outbits.value) {
        set_step_outputs(stepper->step_outbits);
        PULSE_TIMER_CTL |= TACLR|MC0;
    }
}

// Enable/disable limit pins interrupt
static void limitsEnable (bool on, bool homing)
{
    if (on && settings.limits.flags.hard_enabled)
        LIMIT_PORT_IE |= HWLIMIT_MASK; // Enable Pin Change Interrupt
    else
        LIMIT_PORT_IE &= ~HWLIMIT_MASK; // Disable Pin Change Interrupt
}

// Returns limit state as an axes_signals_t variable.
// Each bitfield bit indicates an axis limit, where triggered is 1 and not triggered is 0.
inline static axes_signals_t limitsGetState()
{
    axes_signals_t signals = {0};
    uint8_t flags = LIMIT_PORT_IN;

