terjeio/grblHAL/drivers/MSP430F5529/driver.c
    signals.x = (flags & X_LIMIT_PIN) == X_LIMIT_PIN;
    signals.y = (flags & Y_LIMIT_PIN) == Y_LIMIT_PIN;
    signals.z = (flags & Z_LIMIT_PIN) == Z_LIMIT_PIN;

    if (settings.limits.invert.value)
        signals.value ^= settings.limits.invert.value;

    return signals;
}

// Returns limit state as a control_signals_t variable.
// Each bitfield bit indicates a control signal, where triggered is 1 and not triggered is 0.
inline static control_signals_t systemGetState (void)
{
    control_signals_t signals;
    uint8_t flags = CONTROL_PORT_IN;

    signals.value = settings.control_invert.value;

    signals.reset            = (flags & RESET_PIN) == RESET_PIN;
    signals.feed_hold        = (flags & FEED_HOLD_PIN) == FEED_HOLD_PIN;
    signals.cycle_start      = (flags & CYCLE_START_PIN) == CYCLE_START_PIN;
#ifdef ENABLE_SAFETY_DOOR_INPUT_PIN
    signals.safety_door_ajar = (flags & SAFETY_DOOR_PIN) == SAFETY_DOOR_PIN;
#endif

    if(settings.control_invert.value)
        signals.value ^= settings.control_invert.value;

    return signals;
}

// Sets up the probe pin invert mask to
// appropriately set the pin logic according to setting for normal-high/normal-low operation
// and the probing cycle modes for toward-workpiece/away-from-workpiece.
static void probeConfigure(bool is_probe_away, bool probing)
{
    probe.triggered = Off;
    probe.is_probing = probing;
    probe.inverted = is_probe_away ? !settings.probe.invert_probe_pin : settings.probe.invert_probe_pin;
}

// Returns the probe connected and pin states.
probe_state_t probeGetState (void)
{
    probe_state_t state = {0};

    state.connected = probe.connected;
    state.triggered = !!(PROBE_PORT_IN & PROBE_PIN) ^ probe.inverted;

    return state;
}

// Static spindle (off, on cw & on ccw)

inline static void spindle_off (void)
{
    if(settings.spindle.invert.on)
        SPINDLE_ENABLE_OUT |= SPINDLE_ENABLE_PIN;
    else
        SPINDLE_ENABLE_OUT &= ~SPINDLE_ENABLE_PIN;
}

inline static void spindle_on (void)
{
    if(settings.spindle.invert.on)
        SPINDLE_ENABLE_OUT &= ~SPINDLE_ENABLE_PIN;
    else
        SPINDLE_ENABLE_OUT |= SPINDLE_ENABLE_PIN;
}

inline static void spindle_dir (bool ccw)
{
    if(hal.driver_cap.spindle_dir) {
        if(ccw ^ settings.spindle.invert.ccw)
            SPINDLE_DIRECTION_OUT |= SPINDLE_DIRECTION_PIN;
        else
            SPINDLE_DIRECTION_OUT &= ~SPINDLE_DIRECTION_PIN;
    }
}

// Starts or stops spindle
static void spindleSetState (spindle_state_t state, float rpm)
{
    if (!state.on)
        spindle_off();
    else {
       spindle_dir(state.ccw);
       spindle_on();
    }
}

// Variable spindle control functions

// Sets spindle speed
static void spindle_set_speed (uint_fast16_t pwm_value)
{
    if (pwm_value == spindle_pwm.off_value) {
        pwmEnabled = false;
        if(settings.spindle.disable_with_zero_speed)
            spindle_off();
        if(spindle_pwm.always_on) {
            PWM_TIMER_CCR1 = spindle_pwm.off_value;
            PWM_TIMER_CCTL1 = settings.spindle.invert.pwm ? OUTMOD_6 : OUTMOD_2;
        } else
            PWM_TIMER_CCTL1 = settings.spindle.invert.pwm ? OUT : 0;
    } else {
        if(!pwmEnabled)
            spindle_on();
        pwmEnabled = true;
        PWM_TIMER_CCR1 = pwm_value;
        PWM_TIMER_CCTL1 = settings.spindle.invert.pwm ? OUTMOD_6 : OUTMOD_2;
    }
}

#ifdef SPINDLE_PWM_DIRECT

static uint_fast16_t spindleGetPWM (float rpm)
{
    return spindle_compute_pwm_value(&spindle_pwm, rpm, false);
}

#else

static void spindleUpdateRPM (float rpm)
{
    spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
}

#endif

// Starts or stops spindle
static void spindleSetStateVariable (spindle_state_t state, float rpm)
{
    if (!state.on || rpm == 0.0f) {
        spindle_set_speed(spindle_pwm.off_value);
        spindle_off();
    } else {
        spindle_dir(state.ccw);
        spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
    }
}

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

    state.on = (SPINDLE_ENABLE_In & SPINDLE_ENABLE_PIN) != 0;
    if(hal.driver_cap.spindle_dir)
        state.ccw = (SPINDLE_DIRECTION_IN & SPINDLE_DIRECTION_PIN) != 0;
    state.value ^= settings.spindle.invert.mask;
    if(pwmEnabled)
        state.on = On;

    return state;
}

// end spindle code

// Starts/stops coolant (and mist if enabled)
static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;

    if(mode.flood)
        COOLANT_FLOOD_OUT |= COOLANT_FLOOD_PIN;
    else
        COOLANT_FLOOD_OUT &= ~COOLANT_FLOOD_PIN;

    if(mode.mist)
        COOLANT_MIST_OUT |= COOLANT_MIST_PIN;
    else
        COOLANT_MIST_OUT &= ~COOLANT_MIST_PIN;
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

    state.flood = (COOLANT_FLOOD_IN & COOLANT_FLOOD_PIN) != 0;
    state.mist  = (COOLANT_MIST_IN & COOLANT_MIST_PIN) != 0;

    if(settings.coolant_invert.mask)
        state.value ^= settings.coolant_invert.mask;

    return state;
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    _DINT();
    *ptr |= bits;
    _EINT();
}

static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    _DINT();
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    _EINT();
    return prev;
}

static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
    _DINT();
    uint_fast16_t prev = *ptr;
    *ptr = value;
    _EINT();
    return prev;
}

// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{
    PWM_TIMER_EX0 = settings->spindle.pwm_freq < 1000.0f ? TAIDEX_7 : TAIDEX_1;

    hal.driver_cap.variable_spindle = spindle_precompute_pwm_values(&spindle_pwm, 25000000UL / (PWM_TIMER_EX0 == TAIDEX_1 ? 4 : 16));

