terjeio/grblHAL/drivers/MSP430F5529/driver.c
    if(IOInitDone) {

        stepperEnable(settings->steppers.deenergize);

        int16_t t = (uint16_t)(5.0f * (settings->steppers.pulse_microseconds - STEP_PULSE_LATENCY)) - 1;
        pulse_length = t < 2 ? 2 : t;
        if(hal.driver_cap.step_pulse_delay && settings->steppers.pulse_delay_microseconds > 0.0f) {
            t = (uint16_t)(5.0f * (settings->steppers.pulse_delay_microseconds - 2.0f));
            PULSE_TIMER_CCR1 = t < 2 ? 2 : t;
            hal.stepper.pulse_start = stepperPulseStartDelayed;
        } else
            hal.stepper.pulse_start = stepperPulseStart;

        PULSE_TIMER_CCR0 = pulse_length;

        if(hal.driver_cap.variable_spindle) {
            PWM_TIMER_CCR0 = spindle_pwm.period;
            PWM_TIMER_CCTL1 = settings->spindle.invert.pwm ? OUT : 0;   // Set PWM output according to invert setting and
            PWM_TIMER_CTL |= TACLR|MC0|MC1;                             // start PWM timer (with no pulse output)
            hal.spindle.set_state = spindleSetStateVariable;
        } else
            hal.spindle.set_state = spindleSetState;

        /*************************
         *  Control pins config  *
         *************************/

        control_signals_t control_ies;
        control_ies.mask = ~(settings->control_disable_pullup.mask ^ settings->control_invert.mask);

        CONTROL_PORT_IE &= ~HWCONTROL_MASK;         // Disable control pins change interrupt
        CONTROL_PORT_DIR &= ~HWCONTROL_MASK;         // Disable control pins change interrupt

        if(settings->control_disable_pullup.cycle_start)
            CONTROL_PORT_OUT &= ~CYCLE_START_PIN;
        else
            CONTROL_PORT_OUT |= CYCLE_START_PIN;

        if(settings->control_disable_pullup.feed_hold)
            CONTROL_PORT_OUT &= ~FEED_HOLD_PIN;
        else
            CONTROL_PORT_OUT |= FEED_HOLD_PIN;

        if(settings->control_disable_pullup.reset)
            CONTROL_PORT_OUT &= ~RESET_PIN;
        else
            CONTROL_PORT_OUT |= RESET_PIN;

        if(settings->control_disable_pullup.safety_door_ajar)
            CONTROL_PORT_OUT &= ~SAFETY_DOOR_PIN;
        else
            CONTROL_PORT_OUT |= SAFETY_DOOR_PIN;

        if(control_ies.cycle_start)
            CONTROL_PORT_IES &= ~CYCLE_START_PIN;
        else
            CONTROL_PORT_IES |= CYCLE_START_PIN;

        if(control_ies.feed_hold)
            CONTROL_PORT_IES &= ~FEED_HOLD_PIN;
        else
            CONTROL_PORT_IES |= FEED_HOLD_PIN;

        if(control_ies.reset)
            CONTROL_PORT_IES &= ~RESET_PIN;
        else
            CONTROL_PORT_IES |= RESET_PIN;

        if(control_ies.safety_door_ajar)
            CONTROL_PORT_IES &= ~SAFETY_DOOR_PIN;
        else
            CONTROL_PORT_IES |= SAFETY_DOOR_PIN;

        CONTROL_PORT_REN |= HWCONTROL_MASK;     // Enable pull-ups/pull-down,
        CONTROL_PORT_IFG &= ~HWCONTROL_MASK;    // clear any pending interrupt
        CONTROL_PORT_IE |= HWCONTROL_MASK;      // and enable control pins change interrupt

        /***********************
         *  Limit pins config  *
         ***********************/

        axes_signals_t limit_ies;

        limit_ies.mask = ~(settings->limits.disable_pullup.mask ^ settings->limits.invert.mask);

         if(settings->limits.disable_pullup.x)
             LIMIT_PORT_OUT &= ~X_LIMIT_PIN;
         else
             LIMIT_PORT_OUT |= X_LIMIT_PIN;

         if(settings->limits.disable_pullup.y)
             LIMIT_PORT_OUT &= ~Y_LIMIT_PIN;
         else
             LIMIT_PORT_OUT |= Y_LIMIT_PIN;

         if(settings->limits.disable_pullup.z)
             LIMIT_PORT_OUT &= ~Z_LIMIT_PIN;
         else
             LIMIT_PORT_OUT |= Z_LIMIT_PIN;

         if(limit_ies.x)
             LIMIT_PORT_IES &= ~X_LIMIT_PIN;
         else
             LIMIT_PORT_IES |= X_LIMIT_PIN;

         if(limit_ies.y)
             LIMIT_PORT_IES &= ~Y_LIMIT_PIN;
         else
             LIMIT_PORT_IES |= Y_LIMIT_PIN;

         if(limit_ies.z)
             LIMIT_PORT_IES &= ~Z_LIMIT_PIN;
         else
             LIMIT_PORT_IES |= Z_LIMIT_PIN;

         LIMIT_PORT_REN |= HWLIMIT_MASK;

         /**********************
          *  Probe pin config  *
          **********************/

          if(hal.driver_cap.probe_pull_up)
              PROBE_PORT_OUT |= PROBE_PIN;
          else
              PROBE_PORT_OUT &= ~PROBE_PIN;
          PROBE_PORT_REN |= PROBE_PIN;
    }
}

// Initializes MCU peripherals for Grbl use
static bool driver_setup (settings_t *settings)
{
    /******************
     *  Stepper init  *
     ******************/

    STEP_PORT_DIR |= HWSTEP_MASK;
    DIRECTION_PORT_DIR |= HWDIRECTION_MASK;
    STEPPERS_DISABLE_DIR_XY |= STEPPERS_DISABLE_PIN_XY;
    STEPPERS_DISABLE_DIR_Z |= STEPPERS_DISABLE_PIN_Z;

    // Configure stepper driver timer

    STEPPER_TIMER_EX0 = TAIDEX_0; //
    STEPPER_TIMER_CTL &= ~(ID0|ID1|TAIFG);
    STEPPER_TIMER_CTL |= TACLR|TASSEL1;
    STEPPER_TIMER_CCTL0 |= CCIE;

    // Configure step pulse timer

    PULSE_TIMER_EX0 |= TAIDEX_4; // DIV 5
    PULSE_TIMER_CTL |= TACLR|TASSEL1; // for 0.2uS per count
    PULSE_TIMER_CCTL0 |= CCIE;

#ifdef CNC_BOOSTERPACK_A4998
    STEPPERS_VDD_DIR |= STEPPERS_VDD_BIT;
    STEPPERS_VDD_OUT |= STEPPERS_VDD_BIT;
#endif

   /****************************
    *  Software debounce init  *
    ****************************/

    if(hal.driver_cap.software_debounce)
        WDTCTL = WDT_ADLY_16;   // Watchdog timeout ~16ms

   /***********************
    *  Control pins init  *
    ***********************/

    CONTROL_PORT_DIR &= ~HWCONTROL_MASK;

   /*********************
    *  Limit pins init  *
    *********************/

    LIMIT_PORT_DIR &= ~HWLIMIT_MASK;

   /********************
    *  Probe pin init  *
    ********************/

    PROBE_PORT_DIR &= ~PROBE_PIN;
    if(hal.driver_cap.probe_pull_up) {
        PROBE_PORT_OUT |= PROBE_PIN;
        PROBE_PORT_REN |= PROBE_PIN;
    }

    /***********************
    *  Coolant pins init  *
    ***********************/

